// Переменные:
// 1)var - устаревший вариант переменных
// 2)let - изменяемый тип переменных
// 3)const - не меняемый тип переменных(константа)

// Типы данных:
// 1)Primitive: типы данных, которые непосредственно хранят значения
// a)number - тип данных чисел
// b)string - тип данных строк("", '', ``)
// c)boolean - тип данных булевых значений(true, false, ===, >, <, <=, >=, !, !==)
// d)undefined - тип данных отсутствие значений
// e)null - пустое значение

// 2)Reference: типы данных у которых есть ссылка
// a)object - тип ссылочных данных с ключом и значений
// b)array - тип итерационных(итерация) ссылочных данных

// Функция: тип данных которые имеют свойство вызываться
// function decleration(обьявление функции с ключевым словом function)
// arrow function(стрелочная функция)
// anonymous function(анонимная функция без названий)

// Методы: любой объект имеет свои методы для взаимодействий с данными
// class - правила для создания объектов, создаётся новый объект с ключевым словом new
// 1)Array:
// a)map - итерация каждого элемента, принимает колбэк. Возвращает новый массив
// b)filter - итерация каждого элемента, принимает колбэк. Возвращает новый массив элементов в которых колбэк возвращал true
// c)reduce - итерация каждого элемента, принимает колбэк и начальное состояние результата. Результат колбэк функции меняет состояние
// d)forEach - итерация каждого элемента, принимает колбэк. Ничего не возвращает, просто итерирует
// e)find - принимает любой тип данных и ищет внутри массива. Возвращает найденный элемент или undefined, если ничего не нашел
// f)findIndex - принимает любой тип данных. Вернёт индекс или -1, если не найдено
// g)flat - принимает number
// h)some
// j)include
// k)at
// l)indexOf
// m)lastIndexOf
// o)every
// p)findLast
// q)findLastIndex
// r)join
// s)reverse
// t)concat
// u)push
// v)unshift
// w)pop
// x)shift
// y)slice
// z)splice
// a1)sort
// a2)entries


// 2)Object
// 3)Number
// 4)String
// 5)Boolean
// 6)Math
// 7)Date
